In [1]:
import pandas as pd
import numpy as np
from pandas.testing import assert_frame_equal

In [13]:
students1 = pd.read_csv('./students1.csv')
students2 = pd.read_csv('./students2.csv')
# for remove duplicates use students1.drop_duplicates()

In [14]:
students1
students2

   id     name        dob department      mobile created_on
0   1   Harish  9/21/1993        CSE  1000000000    36:15.8
1   2    Vinod  6/18/1993        CSE  9701550994    37:51.8
2   3  Vinod P  6/18/1993        CSE  9701550994    37:51.8
3   4    Shiva  6/18/1993        ECE  9701550994    36:15.8
4   5  Govinda  6/18/1999      CIVIL  9701550910    37:51.8

In [73]:
students1

# test[test['accounttype'].str.contains("|".join(a))]
#if students1["name"].str.contains("Narayana", na="False").any():

# if students1["name"].str.startswith("Narayana", na="False").any():
#     k= students1["name"].str.startswith("Narayana", na="False").any()
#     print(k.shape[0])
#     print(students1[students1["name"].str.contains("|".join(a))]["name"])
# else:
#     print("NOT Found")


a=["abc"]
# data = students1[students1["name"].str.contains("|".join(a))]["name"].any()



if students1[students1["name"].str.contains("|".join(a))]["name"].any():
    print(students1[students1["name"].str.contains("|".join(a))]["name"].item())
else:
    print("NOT FOUND")

students1[students1["name"].str.contains("|".join(["vinod"]), case=False)]["name"].any()

NOT FOUND

'Vinod'

In [4]:
print (pd.merge(students1,students2, on='name'))

   id_x     name      dob_x department_x    mobile_x created_on_x  id_y  \
0     1   Harish  9/21/1993          CSE  9000620000      36:15.8     1
1     2    Vinod  6/18/1993          CSE  9701550994      37:51.8     2
2     3  Vinod P  6/18/1993          CSE  9701550994      37:51.8     3
3     7    Shiva  6/18/1993         MECH  9701550994      36:15.8     4
4    10  Govinda  6/18/1999        CIVIL  9701550910      37:51.8     5

       dob_y department_y    mobile_y created_on_y
0  9/21/1993          CSE  1000000000      36:15.8
1  6/18/1993          CSE  9701550994      37:51.8
2  6/18/1993          CSE  9701550994      37:51.8
3  6/18/1993          ECE  9701550994      36:15.8
4  6/18/1999        CIVIL  9701550910      37:51.8

In [5]:
# c = assert_frame_equal(students1, students2)
match_inner = pd.merge(students1, students2, how='inner', on=['name'])
match_outer = pd.merge(students1, students2, how='outer', on=['name'])

#print(students1.merge(students2, how='inner', on=['name']))

#print(students1.join(students2,  on=['name'], rsuffix="_stud2"))

print(match_inner)
print(match_outer)

   id_x     name      dob_x department_x    mobile_x created_on_x  id_y  \
0     1   Harish  9/21/1993          CSE  9000620000      36:15.8     1
1     2    Vinod  6/18/1993          CSE  9701550994      37:51.8     2
2     3  Vinod P  6/18/1993          CSE  9701550994      37:51.8     3
3     7    Shiva  6/18/1993         MECH  9701550994      36:15.8     4
4    10  Govinda  6/18/1999        CIVIL  9701550910      37:51.8     5

       dob_y department_y    mobile_y created_on_y
0  9/21/1993          CSE  1000000000      36:15.8
1  6/18/1993          CSE  9701550994      37:51.8
2  6/18/1993          CSE  9701550994      37:51.8
3  6/18/1993          ECE  9701550994      36:15.8
4  6/18/1999        CIVIL  9701550910      37:51.8
   id_x      name      dob_x department_x    mobile_x created_on_x  id_y  \
0     1    Harish  9/21/1993          CSE  9000620000      36:15.8   1.0
1     2     Vinod  6/18/1993          CSE  9701550994      37:51.8   2.0
2     3   Vinod P  6/18/1993          CSE  9701550994      37:51.8   3.0
3     4   Krishna  6/18/1994          ECE  9701556995      36:15.8   NaN
4     6   Krishna  6/18/1996        CIVIL  9201520994      37:51.8   NaN
5     5      Rama  6/18/1995          ECE  8601550996      37:51.8   NaN
6     7     Shiva  6/18/1993         MECH  9701550994      36:15.8   4.0
7     8     Nandi  6/18/1997          ECE  9401550994      37:51.8   NaN
8     9  Narayana  6/18/1998         MECH  9701550894      37:51.8   NaN
9    10   Govinda  6/18/1999        CIVIL  9701550910      37:51.8   5.0

       dob_y department_y      mobile_y created_on_y
0  9/21/1993          CSE  1.000000e+09      36:15.8
1  6/18/1993          CSE  9.701551e+09      37:51.8
2  6/18/1993          CSE  9.701551e+09      37:51.8
3        NaN          NaN           NaN          NaN
4        NaN          NaN           NaN          NaN
5        NaN          NaN           NaN          NaN
6  6/18/1993          ECE  9.701551e+09      36:15.8
7        NaN          NaN           NaN          NaN
8        NaN          NaN           NaN          NaN
9  6/18/1999        CIVIL  9.701551e+09      37:51.8

In [6]:
# It seems you need combine_first with set_index for match by indices created by columns EmpID:

# df = df_first.set_index('EmpID').combine_first(df_second.set_index('EmpID')).reset_index()

In [7]:
A = pd.DataFrame({'product id':   [1455,5452,3775],
                    'serial number':[44,55,66]})


B = pd.DataFrame({'product id':   [7000,2000,1000],
                    'serial number':[44,55,77]})

print(A)
print(B)
AB_inner = pd.merge(A, B, on='serial number', how="inner").reset_index()
AB_outer = pd.merge(A, B, on='serial number', how="outer").reset_index()

print(AB_inner)
print(AB_outer)

   product id  serial number
0        1455             44
1        5452             55
2        3775             66
   product id  serial number
0        7000             44
1        2000             55
2        1000             77
   index  product id_x  serial number  product id_y
0      0          1455             44          7000
1      1          5452             55          2000
   index  product id_x  serial number  product id_y
0      0        1455.0             44        7000.0
1      1        5452.0             55        2000.0
2      2        3775.0             66           NaN
3      3           NaN             77        1000.0

In [8]:
test=A.merge(
    B,
    left_on='serial number',
    right_on='serial number',
    how="outer"
).reset_index()

test1=pd.merge(A,B, on=["serial number"], how="outer")


test2=B.merge(A,on='serial number', how="outer").reset_index()


print(test2)

# pokemonData.merge(
#         sub_pokemonData[pokemonData.Legendary == False], 
#         left_on="Name",
#         right_on="Name",
#         how="inner"
# )

   index  product id_x  serial number  product id_y
0      0        7000.0             44        1455.0
1      1        2000.0             55        5452.0
2      2        1000.0             77           NaN
3      3           NaN             66        3775.0

In [9]:
students1 = pd.read_csv('./students1.csv')
students2 = pd.read_csv('./students2.csv')

std1 = students1.add_prefix("std1_")
std2 = students2.add_prefix("std2_")

inner= std1.merge(std2, left_on=["std1_name"], right_on=["std2_name"], how="inner")
outer= std1.merge(std2, left_on=["std1_name"], right_on=["std2_name"], how="outer")

outer

inner[["std1_name","std2_name"]]

  std1_name std2_name
0    Harish    Harish
1     Vinod     Vinod
2   Vinod P   Vinod P
3     Shiva     Shiva
4   Govinda   Govinda

In [10]:
# dfA['mrp'] = dfB['mrp']
# dfA['matchPrice?'] = np.where(dfA['price'] == dfB['mrp'], 'True', 'False')

students1['name'] = students2['name']
#students1['matchData?'] = np.where(students1['id'] == students2['id'])
students1

   id     name        dob department      mobile created_on
0   1   Harish  9/21/1993        CSE  9000620000    36:15.8
1   2    Vinod  6/18/1993        CSE  9701550994    37:51.8
2   3  Vinod P  6/18/1993        CSE  9701550994    37:51.8
3   4    Shiva  6/18/1994        ECE  9701556995    36:15.8
4   5  Govinda  6/18/1995        ECE  8601550996    37:51.8
5   6      NaN  6/18/1996      CIVIL  9201520994    37:51.8
6   7      NaN  6/18/1993       MECH  9701550994    36:15.8
7   8      NaN  6/18/1997        ECE  9401550994    37:51.8
8   9      NaN  6/18/1998       MECH  9701550894    37:51.8
9  10      NaN  6/18/1999      CIVIL  9701550910    37:51.8

In [11]:
A = pd.DataFrame({'product id':   [1455,5452,3775],
                    'serial number':[44,55,66]})


B = pd.DataFrame({'product id':   [7000,2000,1000],
                    'serial number':[44,55,77]})

print(A)
print(B)

   product id  serial number
0        1455             44
1        5452             55
2        3775             66
   product id  serial number
0        7000             44
1        2000             55
2        1000             77